# -*- coding: utf-8 -*-
"""
Created on Mon Nov  7 21:24:58 2016

@author: Oleg Lyash
"""

""" Что надо сделать:
        ASCII-art
        восстановление здоровья
        инвентарь
        подсчет очков
        выпадение лута
        меню инвентаря (выпить лекарство, взять оружие и т.п.)
        разное :-)
        
"""

# Импортируем модуль для енерации случайных чисел
import random

# Это функция для вывода картинки врага по имени "Дарт Вейдер"
def print_enemy(name):
    # Все картинки взяту отсюда http://text-image.ru/news/?page2
    if name  == "Спок": # Человек
        print("░░░░░░░░░░░░░░░░░░░░░░░░░░░░")
        print("░░░░░░░░▄▄████████▄▄░░░░░░░░")
        print("░░░░░▄███████████████▄░░░░░░")
        print("░░░░▄██████████████████▄░░░░")
        print("░░░██████████████████████░░░")
        print("░░███████████████████████▄░░")
        print("░░██░░▀█████████████▀░████░░")
        print("░███░▄░▀▀▀▀▀███▀▀▀▀▀░░▄▀██░░")
        print("████░██▄▄░░░░░░░░░▄▄▄██░███▄")
        print("░███░░░█████▄░░▄██████▀░████")
        print("▄██▀░░░░▀▀░░░░░██▄▀▀░▀░▄████")
        print("███░▄░░░░░░░░░░██▄░░░░░████░")
        print("░█▄░░░░░░░░░░░░░██▄░░░█████░")
        print("░░█▀░░░░░░▀░▀░▄████▄░▄████░░")
        print("░░░▀▄▄░░░░░░░░░░▀▀█▄░██▀▀░░░")
        print("░░░░░█░░░░░▄▄▄▄▄▄▄██░██░░░░░")
        print("░░░░░░█▄░░░░▄▄▄▄████▄█▀░░░░░")
        print("░░░░░░░█▄░░░░░░░░▀▀▄█▀░░░░░░")
        print("░░░░░░░░▀█▄░░░░░░▄█▀░░░░░░░░")
        print("░░░░░░░░░░░▀▀▀▀▀▀▀░░░░░░░░░░")
        print("░░░░░░░░░░░░░░░░░░░░░░░░░░░░")
    elif name == "Пикачу": # Зомби
        print("░█▀▀▄░░░░░░░░░░░▄▀▀█░░░░░░░░")
        print("░█░░░▀▄░▄▄▄▄▄░▄▀░░░█░░░░░░░░")
        print("░░▀▄░░░▀░░░░░▀░░░▄▀░░░░░░░░░")
        print("░░░░▌░▄▄░░░▄▄░▐▀▀░░░░░░░░░░░")
        print("░░░▐░░█▄░░░▄█░░▌▄▄▀▀▀▀█░░░░░")
        print("░░░▌▄▄▀▀░▄░▀▀▄▄▐░░░░░░█░░░░░")
        print("▄▀▀▐▀▀░▄▄▄▄▄░▀▀▌▄▄▄░░░█░░░░░")
        print("█░░░▀▄░█░░░█░▄▀░░░░█▀▀▀░░░░░")
        print("░▀▄░░▀░░▀▀▀░░▀░░░▄█▀░░░░░░░░")
        print("░░░█░░░░░░░░░░░▄▀▄░▀▄░░░░░░░")
        print("░░░█░░░░░░░░░▄▀█░░█░░█░░░░░░")
        print("░░░█░░░░░░░░░░░█▄█░░▄▀░░░░░░")
        print("░░░█░░░░░░░░░░░████▀░░░░░░░░")
        print("░░░▀▄▄▀▀▄▄▀▀▄▄▄█▀░░░░░░░░░░░")
        print("░░░░░░░░░░░░░░░░░░░░░░░░░░░░")
    elif name == "Профессор": # Гарпия
        print("██████████████████████░░░░░░")
        print("██████████████████████░░░░░░")
        print("█░░██████████████░░░██░░░░░░")
        print("█░░░░██████████░░░░███░░░░░░")
        print("█░░░░░░██████░░░░░████░░░░░░")
        print("█░░░░░░░███░░░░░░█████░░░░░░")
        print("█░░░░░░░░░░░░░░░░░████░░░░░░")
        print("██████░░░███████░░░███░░░░░░")
        print("█░░░░░░█░░░░░░░░░░░░██░░░░░░")
        print("█░░░░░░█░░░░░░░░░░░░░███░░░░")
        print("█░▄▀▀███░░▄▀▀██▄░░░░░░░█░░░░")
        print("█░█─████░░█─████░░░░░░░█░░░░")
        print("█░█▄████░░█▄████░░░░░░░█░░░░")
        print("█░░░░░░█░░░░░░░░░░░░░███░░░░")
        print("█░░░░░░█░░░░░░░░░░░░░█░░░░░░")
        print("█░░░░░░█░░░░░░░░░░░░░█░░░░░░")
        print("█░░░░░░███░░░█░░░░░░░█░░░░░░")
        print("█░░░░░░░░█░░█░░░░░░░░█░░░░░░")
        print("█░░░░░░░░█░█░░░░░░░░░█░░░░░░")
        print("█░░░░░░░░██░░░░░░░░░░█░░░░░░")
        print("█░░░░░░░░░░░░░░░░░░░░█░░░░░░")
        print("█░░░░░░░░░░░░░░░░░░░░█░░░░░░")
        print("█░░░░░░░░░░░░░░░░░░░░█░░░░░░")
        print("██████████░░░░░░░░████░░░░░░")
        print("░░░░░░░█░██░░░░░░██░░█░░░░░░")
        print("░░░░░░░█░░███░░███░░░█░░░░░░")
        print("░░░░░░░█░░░░████░░░░░█░░░░░░")
        print("░░░░░░░█░░░░░██░░░░░░█░░░░░░")
    elif name == "Эльза": # Медуза
        print("███████████████████████████████████")
        print("████████████░──────██▓▒▓███████████")
        print("███████▓▒█░──────░▓▒█▓▓▒───▓███████")
        print("█████▒░▓█▒───░██▓██──░▒▓▓░───▓█████")
        print("███▓─▒▒░█░──██▓───██░─▒─▓▒────▒████")
        print("███░░░──█▓▒█▓───────█▓▓█─▓▒────▒███")
        print("██░░──░█▓▓██────▒▓█▓▓████─▓░────███")
        print("█▒░──▓██▒▓██░───▓█▒───▒█▓█─█─────██")
        print("█░░─▒█▓▓▓▒────────░▓██▓█░░█░░─░▒─▓█")
        print("█░──███████──────▓███▓▓██▓█─▓██▓█▒█")
        print("█░─▓█▓██▒░█▒─────███▒▒░▒█─▓██░░─▓██")
        print("█▓─██▒▒▓▓░▒█░────█▓▓▓▓▓▒──██─█░─▒██")
        print("██─██────░▓▓──────────────░─▓▓▓─█▓█")
        print("██▓██────▓▓────────────────────█▓▒█")
        print("█████─────░──────░───────░█▓░▓██─░█")
        print("██████▒──▒▓▒▒▒▓█▓▒──────░█▓██▒░▓──█")
        print("████─░██──█▓▓▓█▒──────▒██▒▒█──░█──█")
        print("████─░─▓█▓─────────░███▒─▒█▒───█──█")
        print("████▓▒───██─────▒███▓█──▓▓▒────▓─██")
        print("███████──▒██▓▓███▓───█░▒▓░─────████")
        print("████▓─██▓█░█▒░░──────█▓▒▒─────█████")
        print("█████───░──█▓────────█▒▒─────▓█████")
        print("█████▓▒────██▓▓░░──░▓██░─────▓█████")
        print("█████████▒─█████▒▓░█░████░────█░███")
        print("██████▒─▒▒▓░─██▓█─█░█▓─▓█████▓█░─▓█")
        print("███▒─▒█▓─────▒█▒██▒▒█▒▒░░█▓░▒─────█")
        print("█─────▒██▓───▒██▓█▓▓██────██▓█▓───█")
        print("────────█▒▓▓░▓─░█─▒█▒─────░█─░▒█─██")
    elif name == "Волк": # Волк
        print("                   @@@                  ")
        print("                @@@ S@@@                ")
    elif name == "Оборотень": # Оборотень
        print("                   @@@                  ")
        print("                @@@ S@@@                ")
    elif name == "Дарт Вейдер":
        print("     o.oM.MN+oo      ");
        print("   osmMMM.MNNmmM     ");
        print("   sNoMMM.MNNmo.M    ");
        print("  o+oMhyMMMNhddMs    ");
        print("  sNM-smmMNmhh/hNo   ");
        print(" omNyyyyyMNNmNmMMm   ");
        print("ooNNNmmNNNs+ddMMMhs  ");
        print("NNNNNMsNNNssdMMMMh/M ");
        print("oo   oMNyyyyNM   ooo ");
        print("oooMMdddddMMMMdMN+o  ");

# 			Иницаилизируем переменные
#	Типы оружия	
weapon_types = ["кулак","нога","палка","нож","меч"]
#	Сила удара для каждого типа оружия
weapon_power = [1,2,3,4,5]
#	Имена врагов
enemy_names = ["Спок","Пикачу", "Профессор", "Эльза", "Волк", "Оборотень", "Дарт Вейдер"]
#	Сила удара для каждого из врагов
enemy_power = [1,2,3,4,5,6]
#	Признак окончания игры
flag = True
#	Переменная для хранения случайного числа
dice = 0
#	Уровень
level = 1

# Начало игры и вывод заставки на экран
print("###########################################")
print("#                                         #")
print("#           ╔══╗─╔╗╔╗╔═══╗╔╗              #")
print("#           ║╔╗╚╗║║║║║╔══╝║║              #")
print("#           ║║╚╗║║║║║║╚══╗║║              #")
print("#           ║║─║║║║║║║╔══╝║║              #")
print("#           ║╚═╝║║╚╝║║╚══╗║╚═╗            #")
print("#           ╚═══╝╚══╝╚═══╝╚══╝            #")
print("#                                         #")
print("###########################################")
print()
print("Д О Б Р О П О Ж А Л О В А Т Ь")
#	Задаем стартовые параметры для игрока
hero = {"name":"NoName Hero", "weapon":0, "hp":100,"force":10, "luck":0.1}
#	Просим ввести имя персонажа
hero["name"] = input("Назови свое имя герой: ")
#	Приветствуем игрока с использованием введенного им имени
print("Приветствую тебя %s"%(hero["name"]))
#	Описываем куда попал игрок и какие тут правила
print('Ты попал(а) в текстовую игру "ДУЭЛЬ"')
print('Правила игры: ')
print('')
#	Начинаем игру, т.е. запускаем основной цикл игры
print("Начинаем игру")
while flag: # Это начало основного цикла игры
    # Генерируем противника с использованием случайных чисел
    enemy = {"name":"NoName Hero", "hp":100,"force":10, "luck":0.1} 
    enemy["name"] =enemy_names[ random.randrange(len(enemy_names)) ]
    enemy["hp"] = random.randrange(99)+1
    enemy["force"] = random.randrange(9)+1
    enemy["weapon"] = random.randrange(len(weapon_types))
    # Запускаем раунд игры № N (типа уровень)
    print("#########################################")
    print("          Раунд №%s"%(level))
    print("%s (%s) против %s (%s)"%(hero["name"],hero["hp"], enemy["name"], enemy["hp"]))
    # Вывод картинки врага
    # для этого вызываем функцию, которой на вход отправляем номер имени врага в массиве имен врагов :-)
    # эта функция описана выше
    print_enemy(enemy["name"])
    
    isDuel = False
    buf = input("Вызвать на дуэль '%s'? (y/n): "%(hero["name"]))
    if buf == "y":
        isDuel = True
    while isDuel:
        # Ваш удар Определяем его успешность
        print("    ход игрока")
        dice = random.randrange(0,6)
        print(    "%s ударил(а) %s используя %s"%(hero["name"], enemy["name"], weapon_types[hero["weapon"]]))
        if dice + hero["luck"]-enemy["luck"] <3:
            print("    .... и попал(а), отняв %s энергии"%(hero["force"]+weapon_power[hero["weapon"]]))
            enemy["hp"] -= hero["force"]+weapon_power[hero["weapon"]]
        else:
            print("    .....и промазал(а)")
        
        # ход противника
        print("    ход противника")
        dice = random.randrange(0,6)
        print("    %s ударил(а) %s используя %s"%(enemy["name"], hero["name"], weapon_types[hero["weapon"]]))
        if dice + hero["luck"]-enemy["luck"] <3:
            print("    .... и попал(а), отняв %s энергии"%(hero["force"]+weapon_power[hero["weapon"]]))
            hero["hp"] -= enemy["force"]+weapon_power[enemy["weapon"]]
        else:
            print("    .....и промазал(а)")
        
        if hero["hp"]<=0 or enemy["hp"]<=0:
            isDuel = False
            if hero["hp"]<=0:
                print("Вы умерли :-(")
            if enemy["hp"]<=0:
                print("Враг повержен :-(")
                
            break
        
        print("%s (%s) vs %s (%s)"%(hero["name"],hero["hp"], enemy["name"], enemy["hp"]))
        
    print("          Раунд №%s завершен"%(level))
    print("#########################################")    
    isEscape = False
    buf = input("Завршить ?")
    if buf == "y":
        flag = False
    level += 1

